backend/app/controllers/categories_controller.rb

  def index
    render json: Category.select(:id, :name)
---
SELECT "categories"."id", "categories"."name" FROM "categories"
SELECT MIN(id) as id, name FROM "categories" GROUP BY "categories"."name" ORDER BY "categories"."name" ASC