backend/app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5]]
SELECT "products".* FROM "products"
---
  def index
    products = Product.distinct.includes(:user, :category)

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    product = Product.includes(:user, :category).find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = $1  [["user_id", 1]]
---
  def seller
    user = User.find(1)
    products = user.products.includes(:category)